Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: སྤྲིན་ཆེན་པོའི་ཆུའི་བསོད་ནམས་ཀྱི་རྒྱུན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called flow of merit of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་བསོད་ནམས་ཀྱི་སྟོབས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: “There is the samādhi called strength of the merit of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ངེས་པར་སྒྲོགས་པའི་སྟོབས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called strength of proclaiming the certainty of the great cloud.

source: སྤྲིན་ཆེན་པོའི་བསོད་ནམས་ཀྱི་ཆུའི་རོས་སྐོམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called thirsting for the taste of water from the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་རོ་གཅིག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called single taste of the water from the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་སྟོབས་ཀྱིས་ཟློག་པའི་འབྲས་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called fruition that is reversed by the strength of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་བདེ་བསིལ་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of the magical manifestation of the pleasing coolness of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་ཀུ་མུ་དའི་ཟླ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of the moonlight-blossoming kumuda of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུ་ཡིད་དུ་འཐད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called pleasing water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུ་འབབ་པའི་ཤུགས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of the force of the great cloud’s rainfall.

source: སྤྲིན་ཆེན་པོ་ནམ་མཁའ་ལས་སྒྲ་སྒྲོགས་པ་ཡིད་དུ་འཐད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called pleasing sounds of the great cloud that resound in space.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་རོས་རྒྱགས་ཤིང་རབ་ཏུ་དགའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called the satiating and delightful taste of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ནོར་བུའི་ལུས་ལ་ཅོད་པན་བཏགས་པས་སྤུངས་སྐྱེས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called creation of a heap by placing crowns upon the jeweled body of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུ་ཡོངས་སུ་དག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called total purity of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་སྐྱབས་ཀྱི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called seal of refuge of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called seal of stainlessness of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུ་དྲི་མ་མེད་པའི་སྙིང་པོའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect of the stainlessness of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ནོར་བུ་འདྲ་བའི་ཆུ་བསྔགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called praising the jewel-like water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུ་ནད་མེད་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called disease-eliminating water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་སྣོད་ཀྱི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect that is a vessel for the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུ་མི་འཁྲུགས་པའི་རྒྱ་མཚོའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: “There is the samādhi called endowed with the intellect of the undisturbed ocean of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྤྲིན་གྱི་ནང་ནས་ཟླ་བ་བྱུང་བའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called light produced from the moon within the great cloud.

source: སྤྲིན་ཆེན་པོའི་གློག་གིས་མཆོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of making offerings with the lightning of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྟོབས་རྒྱས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called vast strength of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་མཛོད་ཀྱི་རྣམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called storehouse of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུས་དབང་བསྐུར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called bestowing empowerment with the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་བསམ་གཏན་གྱི་མེ་ཏོག་གི་རོས་མྱོས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called intoxicated with the taste of the flower of meditative absorption of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་དམིགས་པ་དག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called pure perception of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་རྗེས་སུ་ཆགས་པའི་སྟོབས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called strength of attachment of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་གནས་ཀྱི་འོད་ཟེར་གྱི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect of the light rays of the abode of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་བརྗོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called expressions of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་དགའ་བས་རབ་ཏུ་དགའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called delighted by the joy of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུ་ཤིན་ཏུ་བརྟན་པར་བྱ་བའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect that is greatly stabilized by the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་སྨན་གྱིས་བརྟན་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of stabilizing with the medicinal water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་རོས་མྱོས་པའི་སྟག་གི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: “There is the samādhi called king of tigers intoxicated by the taste of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་རོས་མྱོས་པའི་སེང་གེའི་སྟབས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king with the style of a lion intoxicated by the taste of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་རོས་མྱོས་པའི་སྤོས་ཀྱི་གླང་པོ་ཆེའི་མཆོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called supreme great mighty elephant intoxicated by the taste of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུ་བདེ་ཞིང་བསིལ་བའི་ཆུ་རྒྱུན་འབབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called pleasing and cooling rain-shower of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུ་འགྲོ་ཞིང་འབབ་པ་མི་འཁྲུགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called undisturbed flowing rainfall of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་བསམ་གཏན་རྫོགས་པའི་ས་བོན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called seed of the perfected meditative absorption of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་འོད་ཐོབ་པ་མི་ཟད་པའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect of the inexhaustible obtainment of the light of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་རྒྱུན་གྱིས་ཀླུའི་སྟོབས་ཡོངས་སུ་སྤངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called abandoning the nāga’s strength with the flowing water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུ་ལ་དགའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called delighting in the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུ་ཡོངས་སུ་བསྒོས་པའི་ཁྱུ་མཆོག་གི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called foremost king who is thoroughly infused with the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་ཙན་དན་གྱི་ཁུ་བ་བསིལ་ཞིང་བདེ་བའི་སྨན་གྱི་བརྩོན་འགྲུས་ཀྱི་གནས་ཀྱིས་ཞི་བར་བྱེད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king who pacifies through the abiding perseverance of the pleasing and cooling medicine, the sandalwood liquid of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་དུག་སྨན་གྲུབ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king who produces the poison antidote of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུས་ས་གཞི་རབ་ཏུ་ཞི་བར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called quenching the earth with the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་སྙིང་པོའི་དྲ་བ་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called net of the essence of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཆུའི་རིན་པོ་ཆེའི་ཆར་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called precious rain of the water of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་སྟོབས་ཀྱི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: “There is the samādhi called endowed with the intellect of the strength of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་ཏོག་གི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect of the emblem of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་ཆུས་ས་གཞི་ཞི་བར་བྱས་པའི་དྲི་ཞིམ་སྤོས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called fragrant incense that has quenched the earth with the water of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་ཆུའི་སྦྱོར་བ་མཐའ་ཡས་པ་ལ་དགའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called delighting in the infinite applications of the water of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་ཁོང་པའི་ཆུའི་སྙིང་པོའི་མྱུར་བའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the quick intellect of the essence of the water within the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོ་མདངས་དཀར་བློ་གྲོས་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called stainless intellect with the white radiance of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོ་འདྲེན་སྤྱོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called guiding conduct of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོ་ཁ་དོག་གི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect of the color of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་ཆུའི་པད་མའི་འོད་མཐའ་ཡས་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called infinite light of the lotus of the water of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་ཆུ་འབབ་པའི་ཡུལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called kingdom of the rainfall of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་ཆུའི་འབྱུང་གནས་ཀྱི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect that is the source of the water of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོ་ངན་སྤོང་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect of the essence of the great cloud that abandons evil.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོ་ཏོག་གི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called light of the emblem of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོ་སྒྲའི་གཟི་བརྗིད་དཔའ་བར་འགྲོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called going with the heroic brilliance of the roar of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོ་སྤྲིན་གྱི་ཤུགས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the power of the cloud of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོ་བརྟན་པའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the steadfast intellect of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་ཆུའི་རྩེད་མོ་ལས་བྱུང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called arising from the play of the water of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་ཆུ་ཤེས་ཉེན་ཅན་གྱི་བློ་གྲོས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called clever intellect of the water of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་ཆུ་སྲུང་བ་ཐམས་ཅད་དུ་མཉམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called equality of all who guard the water of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་ཀུ་ཤ་དང་ར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called orderly kuśa grass of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོ་མདངས་དཀར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called white radiance of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོ་འགྲོ་བའི་གནས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called abode to which the essence of the great cloud goes.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོ་ཆུའི་རྣམ་པའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect with the aspect of the water of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོ་ཆུའི་རྩ་མོ་བསྒྲེང་ཞིང་བརྩེགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called swelling and cresting of the peak of the water of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོ་ཆུ་རྒྱུ་བར་གྱུར་པའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect that sets in motion the water of the essence of the great cloud.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོ་སྤྲིན་གྱི་བདེན་པའི་མཚོའི་ངང་པའི་རྒྱལ་པོའི་སྟབས་ལེགས་པའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect with the virtuous strength of the king of swans in the lake of the truth of the cloud of the essence of the great cloud.

source: ཏིང་ངེ་འཛིན་སྔ་མ་གང་ཡིན་པ་དེ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཏིང་ངེ་འཛིན་གྱི་རྒྱ་མཚོར་ཡང་འགྱུར་རོ། །
en: “Bodhisattva mahāsattvas who possess these aforementioned samādhis will become oceans of samādhi.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་སོམ་ཉི་མི་ཟ་ཞིང་། ཡིད་གཉིས་མེད་དེ། ཐེ་ཙོམ་ཟ་བར་ཡང་མི་འགྱུར་རོ། །
en: They will not be skeptical or ambivalent or entertain doubts about the attainment of unsurpassed, complete, and perfect awakening.

source: ཚེ་རབས་ཐམས་ཅད་དུ་ཐ་ན་རྨི་ལམ་ན་ཡང་སངས་རྒྱས་མཐོང་བ་དང་མི་འབྲལ་བར་ཡང་འགྱུར་རོ། །
en: They will behold the buddhas and never be separated from this sight during all their lifetimes, even in dreams.

source: དེ་དག་གི་དགེ་བའི་ཆོས་རྣམས་ལ་བར་ཆད་བྱ་བའི་ཕྱིར་བདུད་སྡིག་ཅན་གླགས་ལྟ་བ་དང་། སྐབས་ཚོལ་བས་གླགས་རྙེད་པར་ཡང་མི་འགྱུར་རོ། །
en: They will not allow evil Māra to find and take advantage of opportunities to hinder the virtuous Dharmas of the buddhas.

source: དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་ངག་དང་དཔྱོད་པ་ལ་མཁས་པར་ཡང་འགྱུར་རོ། །
en: They will become skilled at analyzing the concealed intent of the Tathāgata’s speech.

source: དེ་བཞིན་གཤེགས་པའི་ཟླ་བའི་དཀྱིལ་འཁོར་གྱི་འོད་ཟེར་དུ་ཡང་འགྱུར་རོ། །
en: They will become the brilliance of the Tathāgata’s moon.

source: དེ་བཞིན་གཤེགས་པ་ནི་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བའོ་ཞེས་རྣམ་པ་ཐམས་ཅད་དུ་ལྟ་བའི་རྒྱ་མཚོ་ཐམས་ཅད་དུ་ཡང་འགྱུར་རོ། །
en: They will become oceans of the views of all the aspects of the Tathāgata, saying that the Tathāgata is permanent, eternal, constant, and tranquil.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་རུས་པ་མ་ཡིན་ཞིང་ཤ་མ་ཡིན་ལ་ཁྲག་མ་ཡིན་ཏེ་རྒྱུས་པ་མ་ཡིན་ནོ་ཞེས་སྟོང་པ་ཉིད་དུ་སྨྲ་བར་ཡང་འགྱུར་རོ། །
en: They will profess emptiness, stating that the Tathāgata’s body is not a body of bone, flesh, blood, or muscle.

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་བསྟན་པ་ནི་འབྲས་བུ་ཡོད་པ་ཡིན་ནོ་ཞེས་འབྲས་བུ་ཡོད་པར་སྨྲ་བར་ཡང་འགྱུར་རོ། །
en: They will profess the existence of fruition, stating that in the Tathāgata’s Dharma teachings, the fruition is existent.

source: བདག་སངས་རྒྱས་སུ་འགྱུར་བར་བྱའོ། །ཞེས་རྟག་ཏུ་དད་པའི་སེམས་སུ་ཡང་འགྱུར་རོ། །
en: Their minds will have permanent faith that they will become a buddha.

source: བདག་གིས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བྱའོ། །བདག་གིས་སེམས་ཅན་རྣམས་དགྲོལ་བར་བྱའོ། །བདག་གིས་སངས་རྒྱས་ཀྱི་གདུང་མི་འཆད་པར་བྱའོ་ཞེས་དམ་འཆའ་ཞིང་སྨོན་ལམ་འདེབས་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་དུ་ཡང་འགྱུར་རོ། །
en: “They will become bodhisattvas, captains, who make the commitment and aspiration, ‘I will turn the wheel of Dharma. I will liberate all sentient beings. I will not cut ties with my buddha heritage.’

source: འཁོར་བའི་ཉོན་མོངས་པའི་རྒྱ་མཚོའི་སྟོན་པ་པོར་ཡང་འགྱུར་རོ། །
en: They will become teachers of the ocean of afflictions of cyclic existence.

source: འཁོར་བའི་སྡུག་བསྔལ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་ཟིན་པའི་མུན་པ་མུན་ནག་བསལ་བའི་ཕྱིར་སྒྲོན་མ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: “They will become like torches because they dispel the thick darkness of those who are seized by all the suffering and afflictions of cyclic existence.

source: དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་རབ་ཏུ་བྱུང་སྟེ། ཚུལ་ཁྲིམས་དང་། སྟོབས་དང་། ཡེ་ཤེས་དང་ལྡན་པའི་ཕྱིར་ཁ་བའི་ཕུང་པོ་ལྟ་བུའི་ཉོན་མོངས་པ་སེལ་བའི་ཉི་མ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like the sun, dissolving afflictions as if melting a snowbank, because they have followed the Tathāgata in going forth to renunciation and because they possess discipline, strength, and gnosis.

source: དཀར་པོའི་ཆོས་ཡོངས་སུ་རྫོགས་པར་བྱས་པའི་ཕྱིར་ཟླ་བ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like the moon because they have perfected positive qualities.

source: ཉོན་མོངས་པའི་རྙོག་པ་སེལ་བའི་ཕྱིར་རྒྱ་མཚོ་དུག་ཅན་པའི་གསེར་གྱི་ཕ་བོང་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like golden boulders within the ocean because they clear away the turbidity of the afflictions.

source: དེ་བཞིན་གཤེགས་པ་གཏན་དུ་མྱ་ངན་ལས་མི་འདའ་ཞིང་ཆོས་ནུབ་པར་མི་འགྱུར་བ་ཐོས་ན་མི་གཡོ་བའི་ཕྱིར་སྒོའི་ཐེམ་པ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like door frames because they will not waver when they hear that the Tathāgata does not pass into parinirvāṇa and that the Dharma will not disappear.

source: དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། མུ་སྟེགས་ཅན་ཕས་ཀྱི་རྒོལ་བ་མང་པོ་དག་གིས་ཕུག་རྡུགས་སུ་མི་ཆུད་ཅིང་སླར་དེ་ལ་ཐབས་ཀྱིས་སྟོན་པར་ཡང་འགྱུར་རོ། །
en: They will not allow themselves to be dug into a hole by the many arguments of ascetics, brahmins, and non-Buddhists and, moreover, will rely on skillful means when dealing with them.

source: སྲོག་གཅོད་པ་བྱེད་ཀྱང་སྲོག་གཅོད་པ་སྤངས་པར་འགྱུར་རོ། །
en: They will engage in taking life while abandoning taking life.

source: མེ་ཏོག་ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མས་གདབ་པ་དང་། ཁྱིམ་པའི་ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱད་པ་རྣམ་པ་དུ་མ་དག་དང་། ཆུང་མ་དང་ལྷན་ཅིག་ཏུ་འདོད་པའི་ཡོན་ཏན་སྤྱོད་ཀྱང་ཤིན་ཏུ་ཚངས་པར་སྤྱོད་པར་ཡང་འགྱུར་རོ། །
en: They will simultaneously engage in all sense pleasures—flower garlands, fragrances, lotions, powders, the enjoyments of householders, various types of servants, and spouses—while maintaining the purest conduct.

source: སྲོག་གཅོད་པ་དང་། རྐུ་འཕྲོག་བྱེད་པ་དང་། བརྫུན་ཚིག་དང་། ཆང་འཐུང་བ་ལ་སོགས་པ་ལ་སྟེན་ཅིང་ལས་རྣམས་བྱེད་ལ། བུ་དང་། ཆུང་མ་རྣམས་སྟོན་ཀྱང་ཤིན་ཏུ་ཚངས་པར་སྤྱོད་པར་ཡང་འགྱུར་རོ། །
en: They will engage in all such activities as killing, stealing, lying, hankering after drink, and so forth, and they will keep company with spouses and children, all while maintaining the purest conduct.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བཞེད་པའི་ང་རྒྱལ་ལ་གནས་པའི་ཡུལ་ལ་མཁས་པར་ཡང་འགྱུར་རོ། །
en: They will become skilled at abiding within the state of pride accepted by all the buddhas.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་མེད་པ་དང་དྲི་མ་མེད་པ་དང་སེམས་ཅན་མེད་པ་གསོ་བ་མེད་པ་འཇིགས་པ་མེད་པ་གསང་བ་རྣམ་པ་མང་པོའི་ཆོས་སྟོན་པའི་རང་བཞིན་དག་ལ་རིན་པོ་ཆེ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will attain the jewel-like pure nature of the Dharma teachings of all the buddhas, with their manifold secret aspects—desirelessness, stainlessness, the absence of self, beings, and persons, and fearlessness.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སེམས་ཅན་འདུལ་བའི་དབང་གིས་ཉོན་མོངས་པའི་རྒྱ་མཚོར་སྐྱེ་བ་བསྟན་ཏེ། རྒལ་ནས་བསྒྲལ་བར་བྱའོ། །
en: Through the power by which all the buddhas tame sentient beings, they will manifest birth within the ocean of suffering, and, thinking, ‘Having crossed over, I will attain liberation;

source: གྲོལ་ནས་དགྲོལ་བར་བྱའོ་སྙམ་ནས་བསྟན་པའི་གསང་བའི་ཁྱད་པར་གྱི་སྒོའི་རང་བཞིན་དག་མཐོང་བར་ཡང་འགྱུར་རོ། །
en: having attained liberation, I will liberate others,’ they will see the pure nature of the special secret gateways that have been taught.

source: ཐབས་ཀྱིས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། ཐབས་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ལྟ་བུར་བཅོས་པའི་དེ་ཁོ་ན་མཐོང་བར་ཡང་འགྱུར་རོ། །
en: They will turn the wheel of Dharma through skillful means and will behold the reality of the expedient wherein, through skillful means, it appears that one passes into parinirvāṇa.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ། མཚུངས་པ་མེད་པ། དཔེ་མེད་པ། གྲངས་མེད་པ། དཔག་ཏུ་མེད་པ། བགྲང་བ་ལས་འདས་པ་ལ་བགྲང་བའི་རྒྱལ་པོར་ཡང་འགྱུར་རོ། །
en: They will become kings of enumerating the inconceivable, unparalleled, incomparable, countless, unfathomable, innumerable domains of all the buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་བསམ་གྱིས་མི་ཁྱབ་པར་འགྲོ་བར་འཇུག་པ་ལ་གནས་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཡིན་པའི་ཏིང་ངེ་འཛིན་དེ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཏིང་ངེ་འཛིན་གྱི་རྒྱ་མཚོར་ཡང་འགྱུར་རོ། །
en: “Great Cloud Essence, bodhisattva mahāsattvas who possess this samādhi, which is the samādhi known as the king of the magical manifestation that abides in entering into inconceivable migrations, will become oceans of samādhi.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་སོམ་ཉི་མི་ཟ་ཞིང་ཡིད་གཉིས་མེད་དེ། ཐེ་ཙོམ་ཟ་བར་ཡང་མི་འགྱུར་རོ། །
en: They will not be skeptical or ambivalent or entertain doubts about the attainment of unsurpassed, complete, and perfect awakening.

source: འཁོར་བའི་ལས་ཀྱི་ཞིང་གི་རྒྱ་མཚོ་ལ་སྲེད་པར་ཡང་མི་འགྱུར་རོ། །
en: They will thirst after the expansive ocean of saṃsāric activity.

source: ཚེ་རབས་ཐམས་ཅད་དུ་ཐ་ན་རྨི་ལམ་ན་ཡང་སངས་རྒྱས་མཐོང་བ་དང་འབྲལ་བར་ཡང་མི་འགྱུར་རོ། །སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ། མཚུངས་པ་མེད་པ། དཔེ་མེད་པ། གྲངས་མེད་པ། དཔག་ཏུ་མེད་པ། བགྲང་བ་ལས་འདས་པ་ལ་བགྲང་བའི་རྒྱལ་པོར་ཡང་འགྱུར་རོ། །
en: They will see the buddhas and never be separated from this sight during all their lifetimes, even in dreams, and so forth as described before, down to they will become kings of enumerating the inconceivable, unparalleled, incomparable, countless, unfathomable, innumerable domains of all the buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་ཏིང་ངེ་འཛིན་བཞི་བརྒྱ་པོ་འདི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཏིང་ངེ་འཛིན་གྱི་རྒྱ་མཚོར་ཡང་འགྱུར་རོ། །
en: “Great Cloud Essence, bodhisattva mahāsattvas who possess these four hundred samādhis will become oceans of samādhi.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་སོམ་ཉི་མི་ཟ་ཞིང་ཡིད་གཉིས་མེད་དེ། ཐེ་ཙོམ་མི་ཟ་བར་ཡང་འགྱུར་རོ། །
en: They will not be skeptical or ambivalent or entertain doubts about the attainment of unsurpassed, complete, and perfect awakening.

source: མི་ཁོམ་པ་རྣམས་སུ་སྐྱེ་བར་ཡང་མི་འགྱུར་རོ། །སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ། མཚུངས་པ་མེད་པ། དཔེ་མེད་པ། གྲངས་མེད་པ། དཔག་ཏུ་མེད་པ། བགྲང་བ་ལས་འདས་པ་ལ་བགྲང་བའི་རྒྱལ་པོར་ཡང་འགྱུར་རོ། །
en: They will not be born in unfree states of existence, and so forth as described before, down to they will become kings of enumerating the inconceivable, unparalleled, incomparable, countless, unfathomable, innumerable domains of all the buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བཞི་བརྒྱ་པོ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དམ་པའི་ཆོས་མི་ཟད་པའི་གཏེར་རིན་པོ་ཆེའི་ཡན་ལག་གི་སྒོ་གང་ཡིན་པ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྒྱ་མཚོར་ཡང་འགྱུར་རོ། །
en: “Great Cloud Essence, bodhisattva mahāsattvas who possess these four hundred samādhi gateways, which are the gateways into the branches of the precious inexhaustible treasury of the sacred Dharma of all the tathāgatas and bodhisattvas, will become oceans of samādhi.
